# PROJECT #3.
CLEANING SCRUBBED.CVS DATA

In [3]:
# Import Dependencies
import pandas as pd
import datetime as dt
from datetime import datetime
from datetime import date
import sqlalchemy

In [4]:
# Name of the CSV file
file = 'scrubbed.csv'
#Read the file
df = pd.read_csv(file, encoding="UTF-8")
# Preview of the DataFrame
df.head()

C:\Users\Celvir\AppData\Local\Temp\ipykernel_4796\2275471134.py:4: DtypeWarning: Columns (5,9) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(file, encoding="UTF-8")

,datetime,city,state,country,shape,duration (seconds),duration (hours/min),comments,date posted,latitude,longitude
0,10/10/1949 20:30,san marcos,tx,us,cylinder,2700,45 minutes,This event took place in early fall around 194...,4/27/2004,29.8830556,-97.941111
1,10/10/1949 21:00,lackland afb,tx,NaN,light,7200,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.38421,-98.581082
2,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.2,-2.916667
3,10/10/1956 21:00,edna,tx,us,circle,20,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.9783333,-96.645833
4,10/10/1960 20:00,kaneohe,hi,us,light,900,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.4180556,-157.803611

In [5]:
# Remove blancks in columns
df.columns = df.columns.str.replace(' ', '')
df.columns

Index(['datetime', 'city', 'state', 'country', 'shape', 'duration(seconds)',
       'duration(hours/min)', 'comments', 'dateposted', 'latitude',
       'longitude'],
      dtype='object')

In [6]:
#Rename columns
df.rename(columns={'duration(seconds)':'duration_seconds',
            'datetime':'date_ocurrence',
           'duration(hours/min)':'duration_hours_min',
           'dateposted':'date_posted'}
           , inplace=True)
df.head()

,date_ocurrence,city,state,country,shape,duration_seconds,duration_hours_min,comments,date_posted,latitude,longitude
0,10/10/1949 20:30,san marcos,tx,us,cylinder,2700,45 minutes,This event took place in early fall around 194...,4/27/2004,29.8830556,-97.941111
1,10/10/1949 21:00,lackland afb,tx,NaN,light,7200,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.38421,-98.581082
2,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.2,-2.916667
3,10/10/1956 21:00,edna,tx,us,circle,20,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.9783333,-96.645833
4,10/10/1960 20:00,kaneohe,hi,us,light,900,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.4180556,-157.803611

In [7]:
df.dtypes

date_ocurrence         object
city                   object
state                  object
country                object
shape                  object
duration_seconds       object
duration_hours_min     object
comments               object
date_posted            object
latitude               object
longitude             float64
dtype: object

In [21]:
states=['AL','AK','AZ','AR','AS','CA','CO','CT','DE','DC','FL','GA','GU','HI','ID','IL','IN','IA','KS','KY','LA','ME','MD',
        'MA','MI','MN','MS','MO','MT','NE','NV','NH','NJ','NM','NY','NC','ND','MP','OH','OK','OR','PA','PR','RI','SC','SD',
        'TN','tx','TT','UT','VT','VA','VI','WA','WV','WI','WY']

In [19]:
country_df=df.loc(df["country"] == )
country_df

Empty DataFrame
Columns: [date_ocurrence, city, state, country, shape, duration_seconds, duration_hours_min, comments, date_posted, latitude, longitude]
Index: []

In [22]:
test_df=df.loc[df["state"].isin(states)]
print(test_df)

         date_ocurrence          city state country      shape  \
0      10/10/1949 20:30    san marcos    tx      us   cylinder
1      10/10/1949 21:00  lackland afb    tx     NaN      light
3      10/10/1956 21:00          edna    tx      us     circle
25     10/10/1977 12:00   san antonio    tx      us      other
32     10/10/1980 19:00       houston    tx      us     sphere
...                 ...           ...   ...     ...        ...
80229    9/9/2008 20:00       el paso    tx      us      light
80240    9/9/2009 19:32    fort worth    tx      us     circle
80268    9/9/2010 21:00        austin    tx      us      light
80292     9/9/2012 9:14  rancho viejo    tx      us  formation
80317    9/9/2013 12:34    cedar park    tx      us      cigar

      duration_seconds duration_hours_min  \
0                 2700         45 minutes
1                 7200            1-2 hrs
3                   20           1/2 hour
25                  30         30 seconds
32                 180              3 min
...                ...                ...
80229           2700.0             45 min
80240            600.0           10 mins.
80268            120.0          2 minutes
80292            120.0        2 minutes +
80317              8.0        5-8 seconds

                                                comments date_posted  \
0      This event took place in early fall around 194...   4/27/2004
1      1949 Lackland AFB&#44 TX.  Lights racing acros...  12/16/2005
3      My older brother and twin sister were leaving ...   1/17/2004
25     i was about six or seven and my family and me ...   2/24/2005
32     Sphere&#44 No lights&#44  moving through neigh...   4/16/2005
...                                                  ...         ...
80229  Bright light seen hovering over the western sk...  10/31/2008
80240  Black round silent object moving slowly to nor...  12/12/2009
80268  Two tiny objects (like dim stars)  fly overhea...  11/21/2010
80292  2 objects moving together or maybe one huge ob...   9/24/2012
80317  Cigar Shaped Object Descending in the Directio...    9/9/2013

         latitude   longitude
0      29.8830556  -97.941111
1        29.38421  -98.581082
3      28.9783333  -96.645833
25     29.4238889  -98.493333
32     29.7630556  -95.363056
...           ...         ...
80229   31.758611 -106.486389
80240   32.725278  -97.320556
80268   30.266944  -97.742778
80292   26.039167  -97.556111
80317      30.505  -97.820000

[3677 rows x 11 columns]

In [102]:
#Clean the typo in latitude
df[df["latitude"] == "33q.200088"]

,date_ocurrence,city,state,country,shape,duration_seconds,duration_hours_min,comments,date_posted,latitude,longitude
43782,5/22/1974 5:30,mescalero indian reservation,nm,NaN,rectangle,180,two hours,Huge rectangular object emmitting intense whit...,4/18/2012,33q.200088,-105.624152

In [103]:
df.at[43782,'latitude']=33.200088
df.at[43782,'latitude']

33.200088

In [104]:
df['duration_seconds'] = df['duration_seconds'].str.replace('`','')

In [105]:
#Convert duration_seconds to float
df['duration_seconds']= df['duration_seconds'].astype(float)

In [106]:
#Convert latitude to float
df['latitude']= df['latitude'].astype(float)

In [107]:
#covert date_posted and datetime to dates
df['date_ocurrence'] = pd.to_datetime(df['date_ocurrence'])
df['date_ocurrence']

0       1949-10-10 20:30:00
1       1949-10-10 21:00:00
2       1955-10-10 17:00:00
3       1956-10-10 21:00:00
4       1960-10-10 20:00:00
                ...
80327   2013-09-09 21:15:00
80328   2013-09-09 22:00:00
80329   2013-09-09 22:00:00
80330   2013-09-09 22:20:00
80331   2013-09-09 23:00:00
Name: date_ocurrence, Length: 80332, dtype: datetime64[ns]

In [108]:
df['date_posted'] = pd.to_datetime(df['date_posted'])
df['date_posted']

0       2004-04-27
1       2005-12-16
2       2008-01-21
3       2004-01-17
4       2004-01-22
           ...
80327   2013-09-30
80328   2013-09-30
80329   2013-09-30
80330   2013-09-30
80331   2013-09-30
Name: date_posted, Length: 80332, dtype: datetime64[ns]

In [109]:
df.dtypes

date_ocurrence        datetime64[ns]
city                          object
state                         object
country                       object
shape                         object
duration_seconds             float64
duration_hours_min            object
comments                      object
date_posted           datetime64[ns]
latitude                     float64
longitude                    float64
dtype: object

In [110]:
df.count()

date_ocurrence        80332
city                  80332
state                 74535
country               70662
shape                 78400
duration_seconds      65536
duration_hours_min    80332
comments              80317
date_posted           80332
latitude              80332
longitude             80332
dtype: int64

In [111]:
df['city'].value_counts()

seattle                                  525
phoenix                                  454
portland                                 374
las vegas                                368
los angeles                              353
                                        ...
playa del cura (grand canaria island)      1
livermore/pleasonton (area)                1
hamburg (germany)                          1
cole camp                                  1
hamstead (hollyridge)                      1
Name: city, Length: 19900, dtype: int64

In [112]:
#example:
df[df['city'] == "hamstead (hollyridge)"]

,date_ocurrence,city,state,country,shape,duration_seconds,duration_hours_min,comments,date_posted,latitude,longitude
80324,2013-09-09 21:00:00,hamstead (hollyridge),nc,NaN,light,NaN,2 minutes,8 to ten lights bright orange in color large t...,2013-09-30,34.367594,-77.710548

In [113]:
df.at[80324,'city']="hampstead"
df[df['city'] == "hampstead"]

,date_ocurrence,city,state,country,shape,duration_seconds,duration_hours_min,comments,date_posted,latitude,longitude
1734,1967-10-15 21:00:00,hampstead,nc,us,disk,300.0,5 minutes,Hampstead North Carolina disk 1967,2012-12-20,34.367500,-77.710833
13610,1998-11-29 01:50:00,hampstead,nc,us,fireball,18.0,18seconds,As we steped out of our car we saw a fireball ...,1999-01-28,34.367500,-77.710833
13892,2013-11-30 18:00:00,hampstead,nh,us,sphere,900.0,15 minutes,3 red spheres&#44 low hovering over lake. Move...,2013-12-02,42.874444,-71.181667
14113,2008-01-13 05:20:00,hampstead,nh,us,light,120.0,2 minutes,Bright Light In Sky Over Rockingham County&#44 NH,2008-01-21,42.874444,-71.181667
14173,2011-01-13 07:30:00,hampstead,nh,us,circle,180.0,3 minutes,Round shiny extremely bright almost silver-loo...,2011-01-31,42.874444,-71.181667
21011,2005-12-28 15:30:00,hampstead,nh,us,sphere,1200.0,20 mins,2 ballon shaped objects came close and then se...,2006-03-11,42.874444,-71.181667
42919,2009-05-17 22:00:00,hampstead,nc,us,triangle,300.0,5 minutes,Star Destroyer shaped ufo low in the night sky...,2009-12-12,34.367500,-77.710833
44222,1991-05-25 21:00:00,hampstead,nh,us,disk,120.0,2 min,It sailed through the sky directly above our b...,2003-12-19,42.874444,-71.181667
53410,2013-06-03 09:34:00,hampstead,nh,us,triangle,3.0,3 seconds,Green cloudy light shooting across the sky,2013-07-03,42.874444,-71.181667
58460,2012-07-20 09:55:00,hampstead,nh,us,circle,300.0,5 minutes,Bright lighted object zigzagging through the sky.,2012-08-05,42.874444,-71.181667
80275,2011-09-09 09:30:00,hampstead,nc,us,diamond,NaN,4-5 min.,Hampstead&#44 N.C 9:30 P.M. diamond 5 minut...,2011-10-10,34.367500,-77.710833
80324,2013-09-09 21:00:00,hampstead,nc,NaN,light,NaN,2 minutes,8 to ten lights bright orange in color large t...,2013-09-30,34.367594,-77.710548

In [114]:
df['state'].unique()

array(['tx', nan, 'hi', 'tn', 'ct', 'al', 'fl', 'ca', 'nc', 'ny', 'ky',
       'mi', 'ma', 'ks', 'sc', 'wa', 'ab', 'co', 'nh', 'wi', 'me', 'ga',
       'pa', 'il', 'ar', 'on', 'mo', 'oh', 'in', 'az', 'mn', 'nv', 'nf',
       'ne', 'or', 'bc', 'ia', 'va', 'id', 'nm', 'nj', 'mb', 'wv', 'ok',
       'ri', 'nb', 'vt', 'la', 'pr', 'ak', 'ms', 'ut', 'md', 'mt', 'sk',
       'wy', 'sd', 'pq', 'ns', 'qc', 'de', 'nd', 'dc', 'nt', 'sa', 'yt',
       'yk', 'pe'], dtype=object)

In [115]:
df['state'].value_counts()

ca    9655
wa    4268
fl    4200
tx    3677
ny    3219
      ...
nf      25
nt      20
pe      17
yt      13
yk       7
Name: state, Length: 67, dtype: int64

In [116]:
df['country'].value_counts()

us    65114
ca     3000
gb     1905
au      538
de      105
Name: country, dtype: int64

In [117]:
df['date_posted'].value_counts()

2009-12-12    1510
2006-10-30    1408
2010-11-21    1237
2008-10-31    1164
2009-03-19    1098
              ...
2004-03-01       4
2003-01-20       2
1999-05-23       2
2003-01-10       1
2002-03-25       1
Name: date_posted, Length: 317, dtype: int64

In [118]:
df['date_ocurrence'].value_counts()

2010-07-04 22:00:00    36
2012-07-04 22:00:00    31
1999-11-16 19:00:00    27
2009-09-19 20:00:00    26
2011-07-04 22:00:00    25
                       ..
2008-02-21 01:38:00     1
2008-02-21 02:00:00     1
2008-02-21 07:00:00     1
2008-02-21 09:45:00     1
2013-09-09 23:00:00     1
Name: date_ocurrence, Length: 69474, dtype: int64

In [119]:
# List unique values of "shape" fyi
df["shape"].unique()

array(['cylinder', 'light', 'circle', 'sphere', 'disk', 'fireball',
       'unknown', 'oval', 'other', 'cigar', 'rectangle', 'chevron',
       'triangle', 'formation', nan, 'delta', 'changing', 'egg',
       'diamond', 'flash', 'teardrop', 'cone', 'cross', 'pyramid',
       'round', 'crescent', 'flare', 'hexagon', 'dome', 'changed'],
      dtype=object)

In [120]:
df_comments=pd.DataFrame(index=df.index)

In [121]:
df_comments['date_ocurrence']=df['date_ocurrence']

In [122]:
df_comments[['latitude','longitude','comments']]=df[['latitude','longitude','comments']]

In [123]:
df_comments

,date_ocurrence,latitude,longitude,comments
0,1949-10-10 20:30:00,29.883056,-97.941111,This event took place in early fall around 194...
1,1949-10-10 21:00:00,29.384210,-98.581082,1949 Lackland AFB&#44 TX. Lights racing acros...
2,1955-10-10 17:00:00,53.200000,-2.916667,Green/Orange circular disc over Chester&#44 En...
3,1956-10-10 21:00:00,28.978333,-96.645833,My older brother and twin sister were leaving ...
4,1960-10-10 20:00:00,21.418056,-157.803611,AS a Marine 1st Lt. flying an FJ4B fighter/att...
...,...,...,...,...
80327,2013-09-09 21:15:00,36.165833,-86.784444,Round from the distance/slowly changing colors...
80328,2013-09-09 22:00:00,43.613611,-116.202500,Boise&#44 ID&#44 spherical&#44 20 min&#44 10 r...
80329,2013-09-09 22:00:00,38.297222,-122.284444,Napa UFO&#44
80330,2013-09-09 22:20:00,38.901111,-77.265556,Saw a five gold lit cicular craft moving fastl...
80331,2013-09-09 23:00:00,35.652778,-97.477778,2 witnesses 2 miles apart&#44 Red &amp; White...

In [124]:
df.drop(columns=['comments'], inplace=True)

In [125]:
df.to_csv("UFO_cleaned.csv", index=True, encoding="UTF-8")
df_comments.to_csv("UFO_comments.csv", index=True, encoding="UTF-8")